#include <iostream>
#include <math.h>
using namespace std;

/*题目：颠倒二进制位

题目描述：

输入一个无符号32位整数，输出颠倒其二进制位后对应的无符号整数。

示例：

输入: 43261596

输出: 964176192

解释: 输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。

输入：4294967293

输出：3221225471

解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，因此返回 3221225471 其二进制表示形式为 10111111111111111111111111111111 。*/

int main() {
	unsigned num, res = 0;
	cin >> num;
	int binary[32] = { 0 };
	int i = 31;
	while (num != 0) {
		binary[i--] = num % 2;
		num /= 2;
	}
	for (int j = 0; j < 32; j++) {
		res += (int)pow((double)2, (double)(j)) * binary[j];
	}
	cout << res << endl;
	return 0;
}